## Terraform Checks (Prod)
#### Format Check 📏`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloudflare-zerotrust.cloudflare_tunnel.clancy: Refreshing state... [id=9caf2b66-1e02-482d-b325-40c34d55e0c2]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.github: Refreshing state... [id=f634c4de-f06b-4050-980b-39faa1115418]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.otp: Refreshing state... [id=50b72fee-0b55-4445-8a40-ab27d77e383b]
module.cloudflare-zerotrust.cloudflare_record.access_app_status: Refreshing state... [id=6787e5741e04f6cb44134afd413d9250]
module.cloudflare-zerotrust.cloudflare_record.access_app_ha: Refreshing state... [id=6278a34b9d053a548a174ded805bdf69]
module.cloudflare-zerotrust.cloudflare_record.access_app_unifi: Refreshing state... [id=d3ff69a56bbe6c42afaa024887f1a415]
module.cloudflare-zerotrust.cloudflare_record.access_app_clancyadmin: Refreshing state... [id=1f4611359f30760769738ffc35c46898]
module.cloudflare-zerotrust.cloudflare_record.access_app_homeradmin: Refreshing state... [id=03bb9f063c57328fe9d6c6635c9412d0]
module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy: Refreshing state... [id=9caf2b66-1e02-482d-b325-40c34d55e0c2]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_application.application: Refreshing state... [id=6cee466e-9ab2-4d61-a760-9fdbef0682ee]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application: Refreshing state... [id=326c177c-a5e4-4818-a86a-65f094eb21d0]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application: Refreshing state... [id=5e88ddf0-ec74-47ad-a75e-2fbc650d0fcc]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application: Refreshing state... [id=5d67eda7-bf1b-4814-a3f1-b30565fc3cb3]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_application.application: Refreshing state... [id=2c358ab2-6213-46f0-b037-df26f5faaef3]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_policy.github_policy: Refreshing state... [id=cc0cd438-1603-475a-a476-c245157e26df]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_policy.github_policy: Refreshing state... [id=b6b249b1-968b-4088-85f3-0bc2127d19a9]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_policy.github_policy: Refreshing state... [id=8c269554-2014-48ed-8a10-24af3f920f8b]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy: Refreshing state... [id=e991e3ba-ec04-4dad-8863-827363c56b5b]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_policy.github_policy: Refreshing state... [id=aa8bdcd6-2827-4e80-9c06-dfeaa41c4249]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.github_verify[0] will be created
  + resource "cloudflare_record" "github_verify" {
      + allow_overwrite = true
      + comment         = "Domain ownership verification for GitHub"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-challenge-morrislan-org"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "e2628155b4"
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>
